pratik252004-proton/VerdantEye_Smart_Flower_Pot/API-MAIN/ESP32WeatherStation.cpp
#include "ESP32WeatherStation.h"

// ---- BITMAP DEFINITIONS GO HERE ----
// Only declare dummy ones here. Replace in your library with your full bitmaps.
const unsigned char ESP32WeatherStation::cityIcon[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ...............................#
  0x00,0x00,0x00,0x00, // ...............................#
  0x00,0x00,0x00,0x00, // ...............................#
  0x00,0x00,0x00,0x00, // ...............................#
  0x00,0x03,0x00,0x00, // ..............##...............#
  0x00,0x07,0x80,0x00, // .............####..............#
  0x00,0x0F,0xC3,0x80, // ............######....###......#
  0x00,0x1C,0xE7,0x80, // ...........###..###..####......#
  0x00,0x38,0x73,0x80, // ..........###....###..###......#
  0x00,0x73,0x3F,0x80, // .........###..##..#######......#
  0x00,0xE7,0x9F,0x80, // ........###..####..######......#
  0x01,0xCF,0xCF,0x80, // .......###..######..#####......#
  0x03,0x9F,0xE7,0x80, // ......###..########..####......#
  0x07,0x3F,0xF3,0x80, // .....###..##########..###......#
  0x0E,0x7F,0xF9,0xC0, // ....###..############..###.....#
  0x1C,0xFF,0xFC,0xE0, // ...###..##############..###....#
  0x39,0xFF,0xFE,0x70, // ..###..################..###...#
  0x73,0xFF,0xFF,0x30, // .###..##################..###..#
  0xE7,0xFF,0xFF,0x90, // ###..####################..##..#
  0x47,0xFF,0xFF,0x80, // .#...####################...#..#
  0x07,0xFF,0xFF,0x80, // .....####################......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xF0,0x3F,0x80, // .....#######......#######......#
  0x07,0xE0,0x1F,0x80, // .....######........######......#
  0x00,0x00,0x00,0x00  // ...............................#
};

const unsigned char ESP32WeatherStation::tempIcon[] PROGMEM = {
  0x00,0x06,0x00,0x00, // .............##.................
  0x00,0x1F,0x80,0x00, // ...........######...............
  0x00,0x19,0xC0,0x00, // ...........##..###..............
  0x00,0x30,0xC0,0x00, // ..........##....##..............
  0x00,0x30,0x40,0x00, // ..........##.....#..............
  0x00,0x30,0x40,0x00, // ..........##.....#..####........
  0x00,0x30,0x4F,0x00, // ..........##.....#..####........
  0x00,0x30,0x4F,0x00, // ..........##.....#..............
  0x00,0x30,0x40,0x00, // ..........##.....#..............
  0x00,0x30,0x4E,0x00, // ..........##.....#..###.........
  0x00,0x37,0x4E,0x00, // ..........##.###.#..##..........
  0x00,0x37,0x40,0x00, // ..........##.###.#..............
  0x00,0x37,0x4F,0x00, // ..........##.###.#..####........
  0x00,0x37,0x4F,0x00, // ..........##.###.#..####........
  0x00,0x37,0x40,0x00, // ..........##.###.#..............
  0x00,0x37,0x40,0x00, // ..........##.###.#..............
  0x00,0x37,0x40,0x00, // ..........##.###.#..............
  0x00,0x37,0x40,0x00, // ..........##.###.#..............
  0x00,0x37,0x40,0x00, // ..........##.###.#..............
  0x00,0x37,0x60,0x00, // ..........##.###.##.............
  0x00,0x67,0x70,0x00, // .........##..###.###............
  0x00,0xCF,0xB0,0x00, // ........##..#####.##............
  0x00,0xDF,0xD8,0x00, // ........##.#######.##...........
  0x01,0xBF,0xD8,0x00, // .......##.########.##...........
  0x01,0xBF,0xD8,0x00, // .......##.########.##...........
  0x01,0xBF,0xD8,0x00, // .......##.########.##...........
  0x00,0xDF,0xD8,0x00, // ........##.#######.##...........
  0x00,0xCF,0xB8,0x00, // ........##..#####.###...........
  0x00,0x62,0x70,0x00, // .........##...#..###............
  0x00,0x78,0xE0,0x00, // .........####...###.............
  0x00,0x1F,0xC0,0x00, // ...........#######..............
  0x00,0x00,0x00,0x00  // ..............#.................
};

const unsigned char ESP32WeatherStation::humidityIcon[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x01,0x00,0x00, // ...............#................
  0x00,0x03,0x00,0x00, // ..............##................
  0x00,0x06,0x80,0x00, // .............##.#...............
  0x00,0x0C,0x80,0x00, // ............##..#...............
  0x00,0x08,0x40,0x00, // ............#....#..............
  0x00,0x18,0x60,0x00, // ...........##....##.............
  0x00,0x10,0x20,0x00, // ...........#......#.............
  0x00,0x32,0x10,0x00, // ..........##..#....#............
  0x00,0x26,0x18,0x00, // ..........#..##....##...........
  0x00,0x44,0x08,0x00, // .........#...#......#...........
  0x00,0x4C,0x0C,0x00, // .........#..##......##..........
  0x00,0x88,0x04,0x00, // ........#...#........#..........
  0x01,0x90,0x06,0x00, // .......##..#.........##.........
  0x01,0x10,0x00,0x00, // .......#...#....................
  0x01,0x30,0x00,0x00, // .......#..##....##..............
  0x01,0x21,0xE0,0x00, // .......#..#....####.............
  0x01,0x11,0x22,0x00, // .......#...#...#..#...#.........
  0x01,0x91,0xE4,0x00, // .......##..#...####..#..........
  0x00,0x8C,0x08,0x00, // ........#...##......#...........
  0x00,0xC0,0x10,0x00, // ........##.........#............
  0x00,0x60,0x37,0x80, // .........##.......##.####.......
  0x00,0x30,0x44,0x80, // ..........##.....#...#..#.......
  0x00,0x0C,0x84,0x80, // ............##..#....#..#.......
  0x00,0x00,0x07,0x00, // .....................###........
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};

const unsigned char ESP32WeatherStation::pressureIcon[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x07,0x0E,0x00,0x00, // .....###....###.................
  0x05,0x0A,0x00,0x00, // .....#.#....#.#.................
  0x05,0x0A,0x00,0x00, // .....#.#....#.#.................
  0x05,0x0A,0x00,0x00, // .....#.#....#.#.................
  0x05,0x0A,0x00,0x00, // .....#.#....#.#.................
  0x05,0x0A,0x08,0x00, // .....#.#....#.#.....#...........
  0x1D,0xFB,0xB6,0x00, // ...###.######.###.##.##.........
  0x0D,0x9B,0x22,0x00, // ....##.##..##.##..#...#.........
  0x07,0x0E,0x42,0x00, // .....###....###..#....#.........
  0x00,0x00,0x02,0x00, // ......................#.........
  0x33,0xFF,0xFE,0x00, // ..##..#################.........
  0x00,0x00,0x00,0x00, // ................................
  0x3D,0xBF,0xFF,0xF0, // ..####.##.##################....
  0x00,0x00,0x00,0x0C, // ............................##..
  0x3E,0x9F,0x40,0x04, // ..#####.#..#####.#...........#..
  0x00,0x00,0x00,0x84, // ........................#....#..
  0x00,0x00,0x00,0x44, // .........................#...#..
  0x00,0x00,0x00,0x7C, // .........................#####..
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};

const unsigned char ESP32WeatherStation::windIcon[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x03,0xE0,0x00, // ..............#####.............
  0x00,0x07,0xF0,0x00, // .............#######............
  0x00,0x06,0x38,0x00, // .............##...###...........
  0x00,0x0C,0x18,0x00, // ............##.....##...........
  0x00,0x0C,0x18,0x78, // ............##.....##....####...
  0x00,0x00,0x19,0xFC, // ...................##..#######..
  0x00,0x00,0x39,0x8E, // ..................###..##...###.
  0x01,0xFF,0xF3,0x06, // .......#############..##.....##.
  0x01,0xFF,0xE3,0x06, // .......############...##.....##.
  0x00,0x00,0x01,0x06, // .......................#.....##.
  0x00,0x00,0x00,0x0E, // ............................###.
  0x7F,0xFF,0xFF,0xFC, // .#############################..
  0x7F,0xFF,0xFF,0xF8, // .############################...
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x0F,0xFF,0xFE,0x00, // ....###################.........
  0x0F,0xFF,0xFF,0x80, // ....#####################.......
  0x00,0x00,0x01,0xC0, // .......................###......
  0x00,0x00,0x00,0xC0, // ........................##......
  0x00,0x00,0x60,0xC0, // .................##.....##......
  0x00,0x00,0x60,0xC0, // .................##.....##......
  0x00,0x00,0x31,0xC0, // ..................##...###......
  0x00,0x00,0x3F,0x80, // ..................#######.......
  0x00,0x00,0x1F,0x00, // ...................#####........
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};
