pratik252004-proton/VerdantEye_Smart_Flower_Pot/API-MAIN/ESP32WeatherStation.cpp
const unsigned char ESP32WeatherStation::clearSky[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x0C,0x00,0x00, // ............##..................
  0x00,0x0C,0x00,0x00, // ............##..................
  0x03,0x0C,0x30,0x00, // ......##....##....##............
  0x03,0x08,0x60,0x00, // ......##....#....##.............
  0x01,0x80,0x60,0x00, // .......##........##.............
  0x00,0x1C,0x00,0x00, // ...........###..................
  0x20,0x7F,0x83,0x00, // ..#......########.....##........
  0x39,0xC1,0xC7,0x00, // ..###..###.....###...###........
  0x19,0x80,0x64,0x00, // ...##..##........##..#..........
  0x03,0x00,0x30,0x00, // ......##..........##............
  0x02,0x00,0x30,0x00, // ......#...........##............
  0x06,0x00,0x10,0x00, // .....##............#............
  0xE6,0x00,0x0F,0x00, // ###..##.............####........
  0xF6,0x00,0x1F,0xC0, // ####.##............#######......
  0x06,0x00,0x30,0x60, // .....##...........##.....##.....
  0x06,0x07,0xE0,0x30, // .....##......######.......##....
  0x03,0x0E,0xC0,0x30, // ......##....###.##........##....
  0x18,0x38,0x00,0x10, // ...##.....###..............#....
  0x39,0xF0,0x00,0x18, // ..###..#####...............##...
  0x23,0x00,0x00,0x18, // ..#...##...................##...
  0x06,0x00,0x00,0x1C, // .....##....................###..
  0x0C,0x00,0x00,0x06, // ....##.......................##.
  0x0C,0x00,0x00,0x03, // ....##........................##
  0x0C,0x00,0x00,0x03, // ....##........................##
  0x0C,0x00,0x00,0x03, // ....##........................##
  0x0C,0x00,0x00,0x03, // ....##........................##
  0x06,0x00,0x00,0x03, // .....##.......................##
  0x07,0x00,0x00,0x06, // .....###.....................##.
  0x03,0xFF,0xFF,0xFC, // ......########################..
  0x00,0xFF,0xFF,0xF8, // ........#####################...
  0x00,0x00,0x00,0x00  // ................................
};

const unsigned char ESP32WeatherStation::cloudRain[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x03,0xC0,0x00, // ..............####..............
  0x00,0x0F,0xF0,0x00, // ............########............
  0x00,0x18,0x18,0x00, // ...........##......##...........
  0x00,0x30,0x0C,0x00, // ..........##........##..........
  0x00,0x60,0x06,0x00, // .........##..........##.........
  0x00,0x40,0x06,0x00, // .........#...........##.........
  0x01,0xC0,0x07,0x80, // .......###...........####.......
  0x03,0x00,0x1F,0xC0, // ......##...........#######......
  0x06,0x00,0x30,0x60, // .....##...........##.....##.....
  0x1E,0x00,0x60,0x30, // ...####..........##.......##....
  0x3E,0x00,0x60,0x10, // ..#####..........##........#....
  0x63,0x00,0x40,0x18, // .##...##.........#.........##...
  0xC3,0xC0,0x40,0x1C, // ##....####.......#.........###..
  0xC0,0xC0,0x00,0x06, // ##......##...................##.
  0x80,0x00,0x00,0x03, // #.............................##
  0x80,0x00,0x00,0x01, // #..............................#
  0x80,0x00,0x00,0x01, // #..............................#
  0xC0,0x00,0x00,0x03, // ##............................##
  0x60,0x00,0x00,0x03, // .##...........................##
  0x70,0x00,0x00,0x06, // .###.........................##.
  0x1F,0xFF,0xFF,0xFC, // ...###########################..
  0x00,0x00,0x00,0x00, // ................................
  0x08,0x10,0x40,0x80, // ....#......#.....#......#.......
  0x18,0x30,0xC1,0x80, // ...##.....##....##.....##.......
  0x10,0x60,0x81,0x00, // ...#.....##.....#......#........
  0x40,0x82,0x04,0x00, // .#......#.....#......#..........
  0xC1,0x86,0x0C,0x00, // ##.....##....##.....##..........
  0x81,0x04,0x08,0x00, // #......#.....#......#...........
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};

const unsigned char ESP32WeatherStation::thunderStorm[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x1F,0xE0,0x00, // ...........########.............
  0x00,0x7F,0xF0,0x00, // .........###########............
  0x00,0xFF,0xFC,0x00, // ........##############..........
  0x01,0xE0,0x3E,0x00, // .......####.......#####.........
  0x03,0xC0,0x1E,0x00, // ......####.........####.........
  0x03,0x80,0x0F,0x00, // ......###...........####........
  0x03,0x80,0x07,0x00, // ......###............###........
  0x07,0x00,0x07,0xE0, // .....###.............######.....
  0x07,0x00,0x03,0xF0, // .....###..............######....
  0x07,0x00,0x03,0xF8, // .....###..............#######...
  0x1F,0x00,0x00,0x3C, // ...#####..................####..
  0x3F,0x00,0x00,0x1E, // ..######...................####.
  0x78,0x00,0x00,0x0E, // .####.......................###.
  0x70,0x00,0x00,0x0E, // .###........................###.
  0x70,0x00,0x00,0x0E, // .###........................###.
  0x70,0x07,0xC0,0x0E, // .###.........#####..........###.
  0x70,0x0F,0xC0,0x0E, // .###........######..........###.
  0x70,0x0F,0x80,0x1E, // .###........#####..........####.
  0x78,0x1F,0x80,0x3C, // .####......######.........####..
  0x3C,0x1F,0x80,0x7C, // ..####.....######........#####..
  0x1F,0xBF,0xF3,0xF8, // ...######.##########..#######...
  0x0F,0x3F,0xE7,0xE0, // ....####..#########..######.....
  0x03,0x3F,0xC7,0x80, // ......##..########...####.......
  0x00,0x0F,0x80,0x00, // ............#####...............
  0x00,0x0F,0x00,0x00, // ............####................
  0x00,0x1E,0x00,0x00, // ...........####.................
  0x00,0x1C,0x00,0x00, // ...........###..................
  0x00,0x38,0x00,0x00, // ..........###...................
  0x00,0x30,0x00,0x00, // ..........##....................
  0x00,0x20,0x00,0x00, // ..........#.....................
  0x00,0x00,0x00,0x00  // ................................
};

const unsigned char ESP32WeatherStation::fog[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x07,0xF8,0x00, // .............########...........
  0x00,0x1F,0xFC,0x00, // ...........###########..........
  0x00,0x38,0x07,0x00, // ..........###........###........
  0x00,0x60,0x03,0x80, // .........##...........###.......
  0x00,0xC0,0x01,0x80, // ........##.............##.......
  0x0F,0x80,0x00,0xC0, // ....#####...............##......
  0x3F,0x00,0x00,0xC0, // ..######................##......
  0x70,0x00,0x00,0x60, // .###.....................##.....
  0x60,0x00,0x00,0x7C, // .##......................#####..
  0xC0,0x00,0x00,0x0E, // ##..........................###.
  0xC0,0x00,0x00,0x06, // ##...........................##.
  0xC0,0x00,0x00,0x03, // ##............................##
  0xC0,0x00,0x00,0x03, // ##............................##
  0x00,0x00,0x00,0x00, // ................................
  0x3F,0xFF,0xFF,0xFC, // ..############################..
  0x7F,0xFF,0xFF,0xFE, // .##############################.
  0x00,0x00,0x00,0x00, // ................................
  0xFF,0xFF,0xFF,0xFF, // ################################
  0xFF,0xFF,0xFF,0xFF, // ################################
  0x00,0x00,0x00,0x00, // ................................
  0x7F,0xFF,0xFF,0xFE, // .##############################.
  0x3F,0xFF,0xFF,0xFC, // ..############################..
  0x00,0x00,0x00,0x00, // ....########################....
  0x00,0x00,0x00,0x00, // ....########################....
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};

