pratik252004-proton/VerdantEye_Smart_Flower_Pot/API-MAIN/ESP32WeatherStation.cpp
const unsigned char ESP32WeatherStation::mist[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0xC3,0x8F,0x1E,0x3C, // ##....###...####...####...####..
  0xFF,0xFF,0xFF,0xFF, // ################################
  0x3C,0x78,0xF1,0xC3, // ..####...####...####...###....##
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0xC3,0x87,0x0E,0x3C, // ##....###....###....###...####..
  0xE7,0xDF,0xBF,0x7E, // ###..#####.######.######.######.
  0x7C,0x79,0xF3,0xE3, // .#####...####..#####..#####...##
  0x00,0x00,0x40,0x80, // .................#......#.......
  0x00,0x00,0x00,0x00, // ................................
  0x83,0x86,0x0C,0x18, // #.....###....##.....##.....##...
  0xE7,0xCF,0x9F,0x7E, // ###..#####..#####..#####.######.
  0x7C,0xF9,0xF3,0xE7, // .#####..#####..#####..#####..###
  0x18,0x30,0x60,0x81, // ...##.....##.....##.....#......#
  0x00,0x00,0x00,0x00, // ................................
  0x81,0x02,0x0C,0x18, // #......#......#.....##.....##...
  0xE7,0xCF,0x9E,0x3E, // ###..#####..#####..####...#####.
  0x7E,0xFD,0xF3,0xE7, // .######.######.#####..#####..###
  0x18,0x30,0xE1,0xC3, // ...##.....##....###....###....##
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0xC7,0x8F,0x1E,0x3C, // ##...####...####...####...####..
  0x7E,0xFD,0xFF,0xFF, // .######.######.#################
  0x3C,0x78,0xE1,0xC3, // ..####...####...###....###....##
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};

const unsigned char ESP32WeatherStation::cloudIcon[] PROGMEM = {
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x3F,0x00, // ..................######........
  0x00,0x00,0xFF,0x80, // ................#########.......
  0x00,0x01,0xC0,0xC0, // ...............###......##......
  0x00,0x3F,0x80,0x60, // ..........#######........##.....
  0x00,0x73,0x00,0x30, // .........###..##..........##....
  0x00,0xC0,0x00,0x30, // ........##................##....
  0x0F,0xC0,0x00,0x30, // ....######................##....
  0x3F,0x80,0x00,0x30, // ..#######.................##....
  0x70,0x00,0x00,0x38, // .###......................###...
  0x60,0x00,0x00,0x3C, // .##.......................####..
  0xC0,0x00,0x00,0x06, // ##...........................##.
  0xC0,0x00,0x00,0x03, // ##............................##
  0x80,0x00,0x00,0x03, // #.............................##
  0x80,0x00,0x00,0x03, // #.............................##
  0xC0,0x00,0x00,0x03, // ##............................##
  0xC0,0x00,0x00,0x03, // ##............................##
  0x60,0x00,0x00,0x03, // .##...........................##
  0x70,0x00,0x00,0x06, // .###.........................##.
  0x3F,0xFF,0xFF,0xFC, // ..############################..
  0x0F,0xFF,0xFF,0xF8, // ....#########################...
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00, // ................................
  0x00,0x00,0x00,0x00  // ................................
};

ESP32WeatherStation::ESP32WeatherStation(Adafruit_SH1106G* display)
  : display(display), ssid(nullptr), password(nullptr), city(""), countryCode(""), apiKey("") {}

void ESP32WeatherStation::setWiFi(const char* ssid, const char* password) {
  this->ssid = ssid;
  this->password = password;
}

void ESP32WeatherStation::setLocation(const String& city, const String& countryCode) {
  this->city = city;
  this->countryCode = countryCode;
}

void ESP32WeatherStation::setAPIKey(const String& key) {
  this->apiKey = key;
}

void ESP32WeatherStation::begin() {
  display->begin(0x3C, true);
  display->clearDisplay();
  display->setCursor(0, 0);
  display->println("Connecting to WiFi...");
  display->display();

  connectWiFi();
  getWeatherData();
}

void ESP32WeatherStation::connectWiFi() {
  WiFi.begin(ssid, password);
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
  }

  display->clearDisplay();
  display->setCursor(0, 0);
  display->println("WiFi connected!");
  display->display();
}

void ESP32WeatherStation::update() {
  display->clearDisplay();

  switch (currentPage) {
    case 0: showPage("City", cityName, cityIcon, currentPage); break;
    case 1: showPage("Temperature", String(temp, 1) + " C", tempIcon, currentPage); break;
    case 2: showPage("Weather", description, getWeatherIcon(description), currentPage); break;
    case 3: showPage("Humidity", String(humidity) + " %", humidityIcon, currentPage); break;
    case 4: showPage("Wind", String(windSpeed, 1) + " m/s", windIcon, currentPage); break;
    case 5: showPage("Pressure", String(pressure) + " hPa", pressureIcon, currentPage); break;
  }

  currentPage = (currentPage + 1) % totalPages;
  delay(3000);
}

void ESP32WeatherStation::getWeatherData() {
  if (WiFi.status() == WL_CONNECTED) {
    HTTPClient http;
    String url = "http://api.openweathermap.org/data/2.5/weather?q=" + city + "," + countryCode + "&appid=" + apiKey + "&units=metric";
    http.begin(url);
    int httpCode = http.GET();

    if (httpCode == 200) {
      String payload = http.getString();
      DynamicJsonDocument doc(1024);
      deserializeJson(doc, payload);

      cityName = doc["name"].as<String>();
      temp = doc["main"]["temp"].as<float>();
      pressure = doc["main"]["pressure"].as<float>();
      humidity = doc["main"]["humidity"].as<float>();
      windSpeed = doc["wind"]["speed"].as<float>();
      description = doc["weather"][0]["description"].as<String>();
    }

    http.end();
  }
}

void ESP32WeatherStation::drawHeader() {
  display->setCursor(30, 0);
  display->setTextSize(1);
  display->println("City Weather");
  display->drawLine(0, 10, 128, 10, SH110X_WHITE);
}

void ESP32WeatherStation::drawFooter(int currentPage) {
  display->drawLine(0, 50, 128, 50, SH110X_WHITE);
  int dotRadius = 2;
  int spacing = 10;
  int startX = (128 - spacing * 5) / 2;
  int y = 58;

  for (int i = 0; i < totalPages; i++) {
    if (i == currentPage)
      display->fillCircle(startX + i * spacing, y, dotRadius, SH110X_WHITE);
    else
      display->drawCircle(startX + i * spacing, y, dotRadius, SH110X_WHITE);
  }
}

void ESP32WeatherStation::showPage(const String& title, const String& data, const uint8_t* icon, int pageIndex) {
  display->clearDisplay();
  display->setTextSize(1);
  display->setTextColor(SH110X_WHITE);
  display->setCursor(2, 17);
  display->println(title + ":");

  display->drawBitmap(85, 16, icon, 32, 32, SH110X_WHITE);
  display->setCursor(2, 33);
  display->println(data);

  drawHeader();
  drawFooter(pageIndex);
  display->display();
}

const uint8_t* ESP32WeatherStation::getWeatherIcon(String desc) {
  desc.toLowerCase();
  if (desc.indexOf("clear") != -1) return clearSky;
  if (desc.indexOf("rain") != -1) return cloudRain;
  if (desc.indexOf("thunder") != -1) return thunderStorm;
  if (desc.indexOf("fog") != -1) return fog;
  if (desc.indexOf("mist") != -1) return mist;
  return cloudIcon;
}
